w6d3/skeleton/app/controllers/tweets_controller.rb

  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hello"], ["created_at", "2016-10-19 22:48:43.903009"], ["updated_at", "2016-10-19 22:48:43.903009"], ["user_id", 10]]